tests/Moneybird.Net.Tests/Responses/Endpoints/ExternalSalesInvoices/getExternalSalesInvoice.json

{
  "id": "478443671070442709",
  "administration_id": "322056713748350877",
  "contact_id": "478443677972170256",
  "contact": {
    "id": "478443677972170256",
    "administration_id": "322056713748350877",
    "company_name": "Moneybird B.V.",
    "firstname": "John",
    "lastname": "Doe",
    "address1": "Hoofdstraat 12",
    "address2": "a",
    "zipcode": "1234AB",
    "city": "Amsterdam",
    "country": "NL",
    "phone": "",
    "delivery_method": "Email",
    "customer_id": "26",
    "tax_number": "NL819341234B01",
    "chamber_of_commerce": "24433159",
    "bank_account": "NL95INGB0109146738",
    "is_trusted": false,
    "max_transfer_amount": null,
    "attention": "attention",
    "email": "billing@example.nl",
    "email_ubl": false,
    "send_invoices_to_attention": "",
    "send_invoices_to_email": "billing@example.nl",
    "send_estimates_to_attention": "",
    "send_estimates_to_email": "billing@example.nl",
    "sepa_active": false,
    "sepa_iban": "NL95INGB0109146738",
    "sepa_iban_account_name": "Account 1",
    "sepa_bic": "INGBNL2A",
    "sepa_mandate_id": "",
    "sepa_mandate_date": null,
    "sepa_sequence_type": "RCUR",
    "credit_card_number": "",
    "credit_card_reference": "",
    "credit_card_type": null,
    "tax_number_validated_at": "2026-02-07T21:24:29.741Z",
    "tax_number_valid": true,
    "invoice_workflow_id": null,
    "estimate_workflow_id": null,
    "si_identifier": "",
    "si_identifier_type": null,
    "moneybird_payments_mandate": false,
    "created_at": "2026-02-07T21:24:29.249Z",
    "updated_at": "2026-02-07T21:24:29.756Z",
    "version": 1770499469,
    "sales_invoices_url": "https://moneybird.com/322056713748350877/sales_invoices/2ccf18efb0adcdb31edcaf1b152bccd4259601c1ad0e8258b357f17cf22f1006/all",
    "notes": [],
    "custom_fields": [],
    "contact_people": [],
    "archived": false
  },
  "date": "2025-11-16",
  "state": "open",
  "due_date": "2026-02-20",
  "reference": "12345",
  "entry_number": 1,
  "origin": "upload",
  "source": "source",
  "source_url": "https://example.nl",
  "currency": "EUR",
  "paid_at": null,
  "created_at": "2026-02-07T21:24:22.667Z",
  "updated_at": "2026-02-07T21:24:55.656Z",
  "version": 1770499495,
  "details": [
    {
      "id": "478443705655625059",
      "administration_id": "322056713748350877",
      "tax_rate_id": "322056714444605375",
      "ledger_account_id": "322056713843771305",
      "project_id": null,
      "product_id": null,
      "amount": "1 x",
      "amount_decimal": "1.0",
      "description": "Test subscription",
      "price": "71.39",
      "period": null,
      "row_order": 0,
      "total_price_excl_tax_with_discount": "59.0",
      "total_price_excl_tax_with_discount_base": "59.0",
      "tax_report_reference": [
        "NL/1a"
      ],
      "mandatory_tax_text": null,
      "created_at": "2026-02-07T21:24:55.650Z",
      "updated_at": "2026-02-07T21:24:55.650Z"
    }
  ],
  "payments": [],
  "total_paid": "0.0",
  "total_unpaid": "71.39",
  "total_unpaid_base": "71.39",
  "prices_are_incl_tax": true,
  "total_price_excl_tax": "59.0",
  "total_price_excl_tax_base": "59.0",
  "total_price_incl_tax": "71.39",
  "total_price_incl_tax_base": "71.39",
  "marked_dubious_on": null,
  "marked_uncollectible_on": null,
  "notes": [],
  "attachments": [
    {
      "id": "478443671078831318",
      "administration_id": "322056713748350877",
      "attachable_id": "478443671070442709",
      "attachable_type": "ExternalSalesInvoice",
      "filename": "Invoice-12345.pdf",
      "content_type": "application/pdf",
      "size": 38313,
      "rotation": 0,
      "created_at": "2026-02-07T21:24:22.675Z",
      "updated_at": "2026-02-07T21:24:22.675Z"
    }
  ],
  "events": [
    {
      "administration_id": "322056713748350877",
      "user_id": "262969831844742919",
      "action": "external_sales_invoice_updated",
      "link_entity_id": null,
      "link_entity_type": null,
      "data": {},
      "created_at": "2026-02-07T21:24:29.340Z",
      "updated_at": "2026-02-07T21:24:29.340Z"
    },
    {
      "administration_id": "322056713748350877",
      "user_id": "262969831844742919",
      "action": "external_sales_invoice_created",
      "link_entity_id": null,
      "link_entity_type": null,
      "data": {},
      "created_at": "2026-02-07T21:24:22.683Z",
      "updated_at": "2026-02-07T21:24:22.683Z"
    },
    {
      "administration_id": "322056713748350877",
      "user_id": "262969831844742919",
      "action": "external_sales_invoice_updated",
      "link_entity_id": null,
      "link_entity_type": null,
      "data": {},
      "created_at": "2026-02-07T21:24:55.659Z",
      "updated_at": "2026-02-07T21:24:55.659Z"
    }
  ],
  "tax_totals": [
    {
      "tax_rate_id": "322056714444605375",
      "taxable_amount": "59.0",
      "taxable_amount_base": "59.0",
      "tax_amount": "12.39",
      "tax_amount_base": "12.39"
    }
  ]
}